app/controllers/board_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    #list 목록 보기
    @list_post=Post.all

INSERT INTO "posts" ("title", "editor", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "제목입니다."], ["editor", "나림입니다."], ["content", "내용이지롱"], ["created_at", "2018-05-28 09:31:54.373537"], ["updated_at", "2018-05-28 09:31:54.373537"]]
---
  def create
   new_post = Post.new
   new_post.title = params[:title]
   new_post.editor = params[:editor]
   new_post.content = params[:content]
   new_post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    #하나 콕! 찝어서 특정 데이터 보는 곳(id번호)
    params[:p_id]
    @show_post = Post.find(params[:p_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @edit_post=Post.find(params[:p_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "editor" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "제목입니다.ㅈㄷㅎ"], ["editor", "나림입니다.ㅈㄷㅎㄷㅈㅎ"], ["content", "내용이지롱ㅈㄷㅎ"], ["updated_at", "2018-05-28 09:34:05.866442"], ["id", 1]]
---
  def update
    update_p=Post.find(params[:p_id])

    update_p.title = params[:title]
    update_p.editor = params[:editor]
    update_p.content = params[:content]

    update_p.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def delete
    Post.find(params[:p_id]).destroy